Reports/НастройкаPDM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>НастройкаPDM</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/НастройкаPDM/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура КонтрольВнешнейКомпоненты(Команда)
	омPDM.ПодключитьБиблиотекуPDM("Внешняя компонента подключена");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКорневойКаталог(Команда)
	Попытка
		
		МойОбъект = Новый COMОбъект("PDM_1C_COM.clPDM_1C_COM");
		Результат = МойОбъект.Root_folder();
		
		Если Результат = "authorization error" Тогда
		
			стДанные = ПолучитьДанныеПодключение();
			Если МойОбъект.Login_PDM(стДанные.Логин, стДанные.Пароль, стДанные.ИмяХранилищаPDM) Тогда
				
				КорневойКаталог = МойОбъект.Root_folder();
				
			Иначе
				
				ПоказатьПредупреждение(, "Ошибка авторизации");
				
			КонецЕсли;	
			
		Иначе
			
			КорневойКаталог = Результат;	
		
		КонецЕсли;
		
		
	Исключение
		Сообщить("Ошибка подключения компоненты. " + ОписаниеОшибки());	
	КонецПопытки;
КонецПроцедуры

Функция ПолучитьДанныеПодключение()

	ТекущийПользоватиель = ПараметрыСеанса.ТекущийПользователь;
	
	стДанные = Новый Структура("ИмяХранилищаPDM, Логин, Пароль", ИмяХранилищаPDM, "", "");
	
	Для каждого х Из тзЛогинПароль Цикл
	
		Если х.Пользователь = ТекущийПользоватиель Тогда
		
			стДанные.Логин 	= х.Логин;	
			стДанные.Пароль = х.Пароль;	
			
			Прервать;
		
		КонецЕсли;	
	
	КонецЦикла;
	
	Возврат стДанные;

КонецФункции


&НаСервере
Процедура СохранитьНаСервере()
	
	МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяНастройки 	= "ИмяХранилищаPDM";
	МенеджерЗаписи.НомерНастройки 	= 0;
	МенеджерЗаписи.Пользователь 	= Справочники.Пользователи.ПустаяСсылка();
	МенеджерЗаписи.Значение			= ИмяХранилищаPDM;
	МенеджерЗаписи.Записать();
	
	Для каждого х Из тзЛогинПароль Цикл 
		
		Если НЕ ЗначениеЗаполнено(х.Пользователь) Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяНастройки 	= "ЛогинPDM";
		МенеджерЗаписи.НомерНастройки 	= 0;
		МенеджерЗаписи.Пользователь 	= х.Пользователь;
		МенеджерЗаписи.Значение			= х.Логин;
		МенеджерЗаписи.Записать();
		
		МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяНастройки 	= "ПарольPDM";
		МенеджерЗаписи.НомерНастройки 	= 0;
		МенеджерЗаписи.Пользователь 	= х.Пользователь;
		МенеджерЗаписи.Значение			= х.Пароль;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мИмяНастройки = Новый Массив(3);
	мИмяНастройки[0] = "ИмяХранилищаPDM";
	мИмяНастройки[1] = "ЛогинPDM";
	мИмяНастройки[2] = "ПарольPDM";
	
	стОбор = Новый Структура("Пользователь", );
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Пользователь КАК Пользователь,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", мИмяНастройки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИмяНастройки = "ИмяХранилищаPDM" Тогда
		
			ИмяХранилищаPDM = Выборка.Значение;	
		
		Иначе
			
			стОбор.Пользователь = Выборка.Пользователь; 
			НайденыеСтроки = тзЛогинПароль.НайтиСтроки(стОбор);
			
			Если НайденыеСтроки.Количество() = 0 Тогда
				НС = тзЛогинПароль.Добавить();
				НС.Пользователь = Выборка.Пользователь;
			Иначе
				НС = НайденыеСтроки[0];
			КонецЕсли;
			
			Если Выборка.ИмяНастройки = "ЛогинPDM" Тогда
				НС.Логин 	= Выборка.Значение;
			Иначе
				НС.Пароль 	= Выборка.Значение;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
